-- select * from apartmentModel;


INSERT INTO apartment (
    building_name, building_block, transaction_type, price, property_type,
    area, floor_and_direction, building_age, extra_Info1,
    extra_Info2, extra_Info3, extra_Info4, confirmation_status, date, deposit_price, month_price
) VALUES
      ('루시아도산208(도시형)', '1동', '매매', 13, '아파트', '60/43.46㎡', '7/12층, 남향', '2년이내', '소형평수', '방한개', '화장실한개', '', '확인매물', '2024-05-27', 0, 0),
      ('장자울', '1동', '매매', 17, '아파트', '106/84.31㎡', '1/7층, 북향', '25년이내', '역세권', '1층', '방세개', '', '확인매물', '2024-05-23', 0, 0),
      ('루시아도산208(도시형)', '1동', '매매', 12, '아파트', '60/43.46㎡', '12/12층, 남향', '2년이내', '소형평수', '탑층', '', '','확인매물', '2024-05-20', 0, 0),
      ('압구정아인빌', '1동', '매매', 18, '아파트', '104/84.36㎡', '고/8층, 남향', '25년이내', '올수리', '방세개', '화장실두개', '', '확인매물', '2024-05-17', 0, 0),
      ('장자울', '1동', '매매', 17, '아파트', '106/84.31㎡', '3/7층, 남향', '25년이내', '올수리', '역세권', '', '','확인매물', '2024-05-09', 0, 0),
      ('토미', '1동', '매매', 11, '아파트', '102/80.83㎡', '저/7층, 남향', '25년이내', '방두개', '화장실두개', '세대당1대', '압구정 역세권 구조좋은 아파트', '확인매물', '2024-05-24', 0, 0),
      ('한양빌라트', '1동', '매매', 18, '아파트', '136/119.69㎡', '저/7층, 남동향', '25년이상', '역세권', '대형평수', '', '','확인매물', '2024-05-10', 0, 0),
      ('논현대우멤버스카운티', '101동', '매매', 25, '아파트', '150/134.68㎡', '중/4층, 남향', '25년이내', '역세권', '대형평수', '방네개이상', '정원뷰가 좋고 내부 상태 깔끔한 집', '확인매물', '2024-05-10', 0, 0),
      ('하얏트빌', '1동', '매매', 11, '아파트', '80/70.95㎡', '저/6층, 남향', '25년이내', '방세개', '화장실두개', '세대당1대', '', '확인매물', '2024-05-17', 0, 0),
      ('루시아도산208(도시형)', '1동', '매매', 14, '아파트', '60/43.26㎡', '6/12층, 북향', '2년이내', '화장실한개', '소형평수', '방한개', '', '확인매물', '2024-04-29', 0, 0),
      ('루시아도산208(도시형)', '1동', '매매', 15, '아파트', '57/41.15㎡', '3/12층, 남동향', '2년이내', '소형평수', '방한개', '', '신축 고급 하이엔드 오피스텔', '확인매물', '2024-05-03', 0, 0),
      ('루시아도산208(도시형)', '1동', '매매', 13, '아파트', '57/41.15㎡', '고/12층, 남동향', '2년이내', '소형평수', '방한개', '', '','확인매물', '2024-05-10', 0, 0),
      ('청림쉐르빌', '1동', '매매', 10, '아파트', '99/84.93㎡', '저/6층, 남향', '25년이내', '소형평수', '방세개', '', '가로수길과 신구처 근처 상태좋은 소형아파트 매매', '확인매물', '2024-05-03', 0, 0),
      ('프라임(80-13)', '1동', '매매', 14, '아파트', '124/97.8㎡', '고/7층, 서향', '25년이내', '역세권', '방세개', '화장실두개', '학동역 도보4분 내외관 상태 양호한 로얄층 아파트', '확인매물', '2024-05-03', 0, 0),
      ('하얏트빌', '1동', '매매', 11, '아파트', '80/70.95㎡', '저/6층, 남향', '25년이내', '방세개', '화장실두개', '세대당1대', '','', '2024-05-17', 0, 0),
      ('한양빌라트', '1동', '매매', 18, '아파트', '136/119.69㎡', '2/7층, 남동향', '25년이상', '역세권', '급매', '대형평수', '','확인매물', '2024-05-10', 0, 0),
      ('루시아도산208(도시형)', '1동', '매매', 15, '아파트', '57/41.15㎡', '3/12층, 남동향', '2년이내', '소형평수', '방한개', '', '신축 고급 하이엔드 오피스텔', '확인매물', '2024-05-03', 0, 0),
      ('루시아도산208(도시형)', '1동', '매매', 13, '아파트', '57/41.15㎡', '고/12층, 남동향', '2년이내', '소형평수', '방한개', '', '','확인매물', '2024-05-10', 0, 0),
      ('청림쉐르빌', '1동', '매매', 10, '아파트', '99/84.93㎡', '저/6층, 남향', '25년이내', '소형평수', '방세개', '', '가로수길과 신구처 근처 상태좋은 소형아파트 매매', '확인매물', '2024-05-03', 0, 0),
      ('프라임(80-13)', '1동', '매매', 14, '아파트', '124/97.8㎡', '고/7층, 서향', '25년이내', '역세권', '방세개', '화장실두개', '학동역 도보4분 내외관 상태 양호한 로얄층 아파트', '확인매물', '2024-05-03', 0, 0);

INSERT INTO apartment (
    building_name, building_block, transaction_type, price, property_type, area,
    floor_and_direction, building_age, extra_Info1, extra_Info2, extra_Info3, extra_Info4,
    confirmation_status, date, deposit_price, month_price
) VALUES
      (
          '논현아이파크(주상복합)', '101동', '전세', 8, '아파트', '69/47.46㎡', '저/19층, 남서향', '4년이내', '',
          '융자금없는', '화장실한개', '', '확인매물', '2024-05-27', 0, 0
      ),
      (
          '논현아이파크(주상복합)', '101동', '전세', 9, '아파트', '86/59.75㎡', '9/19층, 남향', '4년이내', '', '방세개',
          '화장실두개', '중층', '확인매물', '2024-05-18', 0, 0
      ),
      (
          '논현아이파크(주상복합)', '101동', '전세', 9, '아파트', '86/59.75㎡', '중/19층, 남향', '4년이내',
          '쓰리룸 고층 무융자 확장 깔끔한 주상복합아파트', '융자금없는', '방세개', '', '확인매물', '2024-05-23', 0, 0
      ),
      (
          '논현프라임(192-3)', '1동', '전세', 9, '아파트', '144/134.28㎡', '고/7층, 남향', '25년이내',
          '언주역초역세권 입주협의 잘관리된집 귀한전세', '역세권', '대형평수', '방세개', '확인매물', '2024-05-22', 0, 0
      ),
      (
          '한양수자인어반게이트(도시형)', '1동', '전세', 2, '아파트', '23/16.2㎡', '저/9층, 남동향', '15년이내',
          '언주역 역세권 HUG,SH 대출가능 관리인 O 엘베O 풀옵션 원룸', '융자금없는', '역세권', '', '확인매물', '2024-05-18', 0, 0
      ),
      (
          '한양수자인어반게이트(도시형)', '1동', '전세', 2, '아파트', '23/16.2㎡', '고/9층, 동향', '15년이내',
          '실사진O. 언주역 역세권. 풀옵션. 테라스 단독 사용', '테라스', '역세권', '', '확인매물', '2024-05-17', 0, 0
      ),
      (
          '논현아이파크(주상복합)', '101동', '전세', 9, '아파트', '86/59.75㎡', '중/19층, 남향', '4년이내',
          '해 잘드는 정남향', '방세개', '화장실두개', '중층', '확인매물', '2024-05-27', 0, 0
      ),
      (
          '논현아이파크(주상복합)', '101동', '전세', 6, '아파트', '69/47.46㎡', '저/19층, 남향', '4년이내',
          '논현동의 귀한 신축급아파트 룸2욕실1 구조좋은 전망굿 주차매우편리', '방두개', '화장실한개', '세대당 주차 1.5대이상',
          '확인매물', '2024-05-23', 0, 0
      ),
      (
          '논현아이파크(주상복합)', '101동', '전세', 7, '아파트', '69/47.46㎡', '중/19층, 남서향', '4년이내', '',
          '융자금없는', '방두개', '화장실한개', '확인매물', '2024-05-20', 0, 0
      ),
      (
          '논현아이파크(주상복합)', '101동', '전세', 6, '아파트', '69/47.46㎡', '중/19층, 남향', '4년이내', '논현동 신축급컨디션 위치좋고 주변생활편리 인프라좋은 2룸 전세매물', '융자금없는', '방두개', '화장실한개', '확인매물', '24-05-02',0,0);

    INSERT INTO apartment (
       building_name, building_block, transaction_type, month_price, property_type, area, floor_and_direction,
       building_age, extra_Info1, extra_Info2, extra_Info3, extra_Info4, date, confirmation_status,deposit_price, price
        )VALUES
          ('현대2차', '201동', '월세', 230, '아파트', '97/84.92㎡', '5/13층, 남향', '25년이상', '융자금없는', '올수리', '', '', '2024-05-23', '확인매물',2,0),
          ('현대2차', '201동', '월세', 300, '아파트', '97/84.92㎡', '저/13층, 남향', '25년이상', '융자금없는', '방세개', '', '선방 제공', '2024-05-10', '확인매물',1,0),
          ('현대2차', '201동', '월세', 190, '아파트', '97/84.92㎡', '5/13층, 남향', '25년이상', '융자금없는', '올수리', '', '공실클럽 제공', '2024-05-03', '확인매물',3,0),
          ('현대2차', '201동', '월세', 210, '아파트', '97/84.92㎡', '5/13층, 남향', '25년이상', '방세개', '화장실한개', '', '공실클럽 제공', '2024-05-03', '확인매물',2,0),
          ('현대2차', '201동', '월세', 190, '아파트', '97/84.92㎡', '5/13층, 남향', '25년이상', '방세개', '화장실한개', '', '공실클럽 제공', '2024-05-03', '확인매물',3,0),
          ('현대2차', '201동', '월세', 300, '아파트', '97/84.92㎡', '저/13층, 남향', '25년이상', '융자금없는', '방세개', '', '선방 제공', '2024-05-16', '확인매물',1,0),
          ('현대2차', '201동', '월세', 230, '아파트', '97/84.92㎡', '저/13층, 남향', '25년이상', '융자금적은', '올수리', '방세개', '선방 제공', '2024-05-09', '확인매물',2,0),
          ('현대2차', '201동', '월세', 220, '아파트', '97/84.92㎡', '저/13층, 남향', '25년이상', '융자금없는', '올수리', '방세개', '선방 제공', '2024-05-09', '확인매물',2,0),
          ('현대2차', '201동', '월세', 175, '아파트', '97/84.76㎡', '고/13층, 남향', '25년이상', '방세개', '화장실한개', '', '공실클럽 제공', '2024-05-09', '확인매물',3,0),
          ('현대2차', '201동', '월세', 175, '아파트', '97/84.76㎡', '중/13층, 남향', '25년이상', '방세개', '화장실한개', '', '공실클럽 제공', '2024-05-09', '확인매물',3,0);
